function SV_d = DualArm_FourTips_SV_v3( ~ ) % ~ は void と一緒

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%% 変数の初期化 %%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

n = 8;
SV_d.q = zeros(n,1);   % 関節角
SV_d.qd  = zeros(n,1); % 関節角速度
SV_d.qdd = zeros(n,1); % 関節角加速度

SV_d.v0  = zeros(3,1); % ベースの並進速度
SV_d.w0  = zeros(3,1); % ベースの角速度
SV_d.vd0 = zeros(3,1); % ベースの加速度
SV_d.wd0 = zeros(3,1); % ベースの角加速度

SV_d.vv = zeros(3,n); % 各リンクの重心速度
SV_d.ww = zeros(3,n); % 各リンクの重心角速度
SV_d.vd = zeros(3,n); % 各リンクの重心加速度
SV_d.wd = zeros(3,n); % 各リンクの重心角加速度

SV_d.R0 = zeros(3,1); % ベースの位置
SV_d.Q0 = zeros(3,1); % ベースの角度 (オイラー角表現)
SV_d.A0 = eye(3);     % ベースの角度 (方向余弦行列表現)  eyeは単位行列

SV_d.Fe = zeros(3,n); % 端点へかかる外力
SV_d.Te = zeros(3,n); % 端点へかかるトルク
SV_d.F0 = zeros(3,1); % ベース重心へかかる外力
SV_d.T0 = zeros(3,1); % ベース重心へかかるトルク

SV_d.tau = zeros(n,1); % 各関節へかかる軸トルク


%%% EOF